escrow-backend/app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
    def index
        @contracts = Contract.all

INSERT INTO "contracts" ("buyer_address", "seller_address", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["buyer_address", "666666"], ["seller_address", "8989899"], ["amount", 15.0], ["created_at", "2021-04-27 01:52:49.541992"], ["updated_at", "2021-04-27 01:52:49.541992"]]
---
      def create
        @contract = Contract.new(contract_params)
        if @contract.save

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      def show
        @contract = Contract.find(params[:id])